/****************************************************************************************
 * 文件名  ：main.c
 * 描述    ：
 * 开发平台：linux
 * 开发工具：gcc-4.8.4/arm-linux-gnueabihf-gcc-4.9.4
 ***************************************************************************************/
#include "main.h"
#include "ipc_udp.h"
#include "uart.h"

//=======================================================================================
//全局变量定义
//状态标志定义
int network_status  = 0;	//网络连接状态，0网络未连接，1连接在线，2连接断开
//=======================================================================================

/****************************************************************************************
 * 函数名  ：main
 * 描述    ：主函数，负责传入的参数判断，网络连接监听，线程初始化等
 * 输入    ：无
 * 输出    ：无
 * 返回    ：无
 ***************************************************************************************/
int main(int argc, char *argv[])
{
	signal(SIGPIPE, SIG_IGN);				//屏蔽掉SIGPIPE信号，防止网络断开时退出进程

	if(argc < 2)
	{
		printf("Usage:%s [debug-flag]\n",argv[0]);
		exit(1);
	}

	Init_ipc_udp_pthread();

	while (1) 
	{
		sleep(10);
	}
}
